In [2]:
import numpy as np
import pandas as pd

s1 = pd.Series([1, 2, 3, 4, 5])
s2 = pd.Series([10, 20, 30, 40, 50])

df = pd.DataFrame({'A': s1, 'B': s2})

#通过字典来创建
df = pd.DataFrame(
  {
    "id": [1, 2, 3, 4, 5],
    "name": ["Alice", "Bob", "Charlie", "David", "Eva"],
    "age": [25, 30, 35, 40, 45],
    "city": ["New York", "Los Angeles", "Chicago", "Houston", "Phoenix"]
  },index=[1, 2, 3, 4, 5]
)
df

   id     name  age         city
1   1    Alice   25     New York
2   2      Bob   30  Los Angeles
3   3  Charlie   35      Chicago
4   4    David   40      Houston
5   5      Eva   45      Phoenix